#+TITLE: Doom Emacs

* Misc
** TODO 阅读 Doom Emacs 的 Module Document [1/54]
*** TODO :feature [0/6]
**** TODO eval
**** TODO evil
**** TODO file-templates
**** TODO loopup
**** TODO snippets
**** TODO workspaces
*** TODO :completion [1/2]
**** DONE company
**** TODO ivy
*** TODO :ui [0/11]
**** TODO doom
**** TODO doom-dashboard
**** TODO doom-quit
**** TODO evil-goggles
**** TODO hl-todo
**** TODO modeline
**** TODO treemacs
**** TODO popup
**** TODO vc-gutter
**** TODO vi-tilde-fringe
**** TODO window-select
*** TODO :editor [0/4]
**** TODO fold
**** TODO format
**** TODO multiple-cursors
**** TODO rotate-text
*** TODO :emacs [0/4]
**** TODO dired
**** TODO electric
**** TODO imenu
**** TODO vc
*** TODO :tools [0/6]
**** TODO flycheck
**** TODO lsp
**** TODO macos
**** TODO magit
**** TODO rgb
**** TODO wakatime
*** TODO :lang [0/10]
**** TODO cc
**** TODO data
**** TODO emacs-lisp
**** TODO go
**** TODO javascript
**** TODO markdown
**** TODO org
**** TODO python
**** TODO sh
**** TODO web
*** TODO :app [0/0]
*** TODO :collab [0/0]
*** TODO :config [0/1]
**** TODO default

* PROJ 配置 Doom Emacs [7/18]
:LOGBOOK:
CLOCK: [2019-05-14 Tue 16:17]--[2019-05-14 Tue 16:32] =>  0:15
:END:
** DONE 配置 wakatime
** DONE 修改 Key bindings [5/5]
:LOGBOOK:
CLOCK: [2019-05-15 Wed 16:31]--[2019-05-15 Wed 16:39] =>  0:08
:END:
- [X] 搜索 Doom Emacs 如何 unmap keybinds
- [X] Rebind =Spc b b=
- [X] Rebind =Spc w d=
- [X] Rebind =Spc b d=
- [X] Rebind =Spc Spc=

** DONE 配置 Python 开发环境
** TODO 配置前端开发环境
** DONE 配置 cnfonts
** DONE 配置 child frame
** DONE 解决中文自动补全的问题
:PROPERTIES:
:CREATED: [2019-05-15 Wed 14:10]
:END:
** DONE 阅读其他人的 Doom Emacs 配置
:LOGBOOK:
CLOCK: [2019-05-16 Thu 09:59]--[2019-05-16 Thu 10:18] =>  0:19
:END:
** TODO 重新设定 org-mode 系统 [0/9]
:LOGBOOK:
CLOCK: [2019-05-12 Sun 18:17]--[2019-05-12 Sun 18:41] =>  0:24
CLOCK: [2019-05-10 Fri 14:20]--[2019-05-10 Fri 14:34] =>  0:14
CLOCK: [2019-05-10 Fri 11:34]--[2019-05-10 Fri 11:49] =>  0:15
:END:

*** TODO 添加 http://doc.norang.ca/org-mode.html 的配置
*** TODO 配置 org-mode 相关快捷键 [0/2]
- [ ] 显示最近的 clock history
- [ ] 跳转到正在 clocking 的 item
*** TODO 配置 org-mode 的项目结构
:LOGBOOK:
CLOCK: [2019-05-13 Mon 11:21]--[2019-05-13 Mon 11:34] =>  0:13
CLOCK: [2019-05-13 Mon 11:09]--[2019-05-13 Mon 11:15] =>  0:06
:END:
Projects, todo item 和 checklist item 维度：

- Project: 比较大的项目，例如「阅读 5 本技术相关书籍」，它还可以细分成 5 个小的 Project，比如「阅读《代码大全》」，这种比较大的项目一般是在年度计划、季度计划、月度计划、周计划中指定的；
- Todo：todo 和 checklist 的界限比较模糊，todo 就是一个可以完成的任务，但是也可以包括好几个 checklist，例如阅读某些文章，这些文章可以以 checklist 的方式来汇总到某个 todo 下面；又例如「写 GitChat 教程：Python 入门指南」应该是一个 todo，但是这个 todo 可以由1）编写 outline；2）搜索资料；3）编写正文；4）修订；等多个 checklist item 完成，具体的分隔界限应该在使用中灵活确认。

应该尽量使用 PROJ 的维度来进行计时，这样可以方便后期回顾，单个的任务可以放到 Misc 这个 Project 中。
*** TODO 配置 todo state
*** TODO 配置 Tags
*** TODO 配置 Custome Agenda View
*** TODO 设定 macOS global capture
*** TODO 迁移 OmniFocus 上的数据
*** TODO 配置 org-mode pomodoro
* TODO Clocking time with Org-mode
[2019-05-11 Sat 19:43]
https://writequit.org/denver-emacs/presentations/2017-04-11-time-clocking-with-org.html

** TODO test some todo items
:PROPERTIES:
:CREATED: [2019-05-14 Tue]
:END:
